# LightDistribution Methods

---
The LightDistribution type exposes the following members.
| Name| Description
---|---|---
| Clone|  Creates a copy of the LightDistribution derived object.
| Dispose|
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
LightDistribution Class
Autodesk.Revit.DB.Lighting Namespace